class Chat {
    constructor(name, text, time, messageCount) {
        this.name = name;
        this.text = text;
        this.time = time;
        this.messageCount = messageCount;
    }
}
export const CHAT_LIST = [
    new Chat('Андрей', 'И Human Interface Guidelines и Material Design рекомендуют', '10:49', 4),
    new Chat('Андрей', 'И Human Interface Guidelines и Material Design рекомендуют', '10:49', 4),
    new Chat('Андрей', 'И Human Interface Guidelines и Material Design рекомендуют', '10:49', 4),
    new Chat('Андрей', 'И Human Interface Guidelines и Material Design рекомендуют', '10:49', 4),
    new Chat('Андрей', 'И Human Interface Guidelines и Material Design рекомендуют', '10:49', 4),
    new Chat('Андрей', 'И Human Interface Guidelines и Material Design рекомендуют', '10:49', 4),
    new Chat('Андрей', 'И Human Interface Guidelines и Material Design рекомендуют', '10:49', 4),
    new Chat('Андрей', 'И Human Interface Guidelines и Material Design рекомендуют', '10:49', 4),
    new Chat('Андрей', 'И Human Interface Guidelines и Material Design рекомендуют', '10:49', 4),
    new Chat('Андрей', 'И Human Interface Guidelines и Material Design рекомендуют', '10:49', 4),
    new Chat('Андрей', 'И Human Interface Guidelines и Material Design рекомендуют', '10:49', 4)
];
class Message {
    constructor(className, text, date) {
        this.className = className;
        this.text = text;
        this.date = date;
    }
}
export const MESSAGE_LIST = [
    new Message('incoming', 'Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.', '11:56'),
    new Message('incoming', 'Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.', '11:56'),
    new Message('outgoing', 'Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.', '11:56'),
    new Message('incoming', 'Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.', '11:56'),
    new Message('incoming', 'Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.', '11:56'),
    new Message('incoming', 'Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.', '11:56')
];
//# sourceMappingURL=mock.js.map