export const chat = `
    {{{ chatsBar }}}
    <div class="chat">
        <div class="chat__content">
            <header class="chat__header">
                <div class="chat__header-icon">
                    <div class="chat__header-avatar"></div>
                    <span>Вадим</span>
                </div>
                <button type="button" class="chat__options"></button>
            </header>
            <div class="chat__dialog">
                <div class="chat__date">19 июня</div>

                <div class="message incoming">
                    <div class="message__content">
                        <div class="message__text">
                            Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то
                            момент
                            попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что
                            астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще
                            находятся на
                            поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой.

                            Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так
                            никогда
                            и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за
                            45000
                            евро.
                            <div class="message__date">11:56</div>
                        </div>
                    </div>
                </div>
                <div class="message outgoing">
                    <div class="message__content">
                        <div class="message__text">
                            Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то
                            момент
                            попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что
                            астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще
                            находятся на
                            поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой.

                            Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так
                            никогда
                            и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за
                            45000
                            евро.
                            <div class="message__date">11:56</div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
        {{{ footer }}}
    </div>
`;
//# sourceMappingURL=chat.template.js.map